[
	{
		"id": "17",
		"name": "Cure",
		"level": 1,
		"manaCost": 5,
		"basic": "Removes all negative spell effects from target, allied troop and heals it for ((Power x 5) + 10) health points.",
		"advanced": "Removes all negative spell effects from target, allied troop and heals it for ((Power x 5) + 20) health points.",
		"expert": "Removes all negative spell effects from all allied troops and heals each for ((Power x 5) + 30) health points.",
		"imageUrl": "cure.png",
		"magic": "water"
	},
	{
		"id": "18",
		"name": "Dispel",
		"manaCost": 5,
		"basic": "Removes all spell effects from target, allied creature troop.",
		"advanced": "Removes all spell effects from target allied or enemy creature troop.",
		"expert": "Removes all spell effects from all creatures on the battlefield.",
		"imageUrl": "dispel.png",
		"magic": "water"
	},
	{
		"id": "19",
		"name": "Bless",
		"level": 1,
		"manaCost": 5,
		"basic": "One friendly target unit inflicts maximum damage when it attacks.",
		"advanced": "One friendly target unit inflicts maximum damage +1 when it attacks.",
		"expert": "All friendly units' inflict maximum damage +1 when they attack.",
		"imageUrl": "bless.png",
		"magic": "water"
	},
	{
		"id": "20",
		"name": "Protection from Water",
		"level": 1,
		"manaCost": 5,
		"basic": "Damage from Water Magic spells is reduced by 30% for target, allied troop.",
		"advanced": "Damage from Water Magic spells is reduced by 50% for target, allied troop.",
		"expert": "Damage from Water Magic spells is reduced by 50% for all allied troops.",
		"imageUrl": "protection_from_water.png",
		"magic": "water"
	},
	{
		"id": "21",
		"name": "Summon Boat",
		"level": 1,
		"manaCost": 6,
		"basic": "Summons one of your hero's boats to their current location. If none of those boats are available, then one of your other heroes' boats is summoned. Spell has a 50% chance of working. The spell fails if there are no unoccupied boats available.",
		"advanced": "Same as Basic effect, except that if no boats are available, a new one is created. The spell has a 75% chance of working. There are a maximum of sixty-four boats allowed on the Adventure Map at one time. The spell fails if all are occupied.",
		"expert": "Same as Advanced effect, except that the spell has a 100% chance of working (unless all sixty-four boats are occupied).",
		"imageUrl": "summon_boat.png",
		"magic": "water"
	},
	{
		"id": "22",
		"name": "Ice Bolt",
		"level": 2,
		"manaCost": 8,
		"basic": "One enemy target unit receives ((Power x 20) + 10) damage.",
		"advanced": "One enemy target unit receives ((Power x 20) + 20) damage.",
		"expert": "One enemy target unit receives ((Power x 20) + 50) damage.",
		"imageUrl": "ice_bolt.png",
		"magic": "water"
	},
	{
		"id": "23",
		"name": "Remove Obstacle",
		"level": 2,
		"manaCost": 7,
		"basic": "Removes one, non-magic obstacle from the battlefield. Integrated obstacles, such as cliffs are not affected.",
		"advanced": "Same as Basic effect, except Fire Walls may also be removed.",
		"expert": "Same as Advanced effect, except all, non-integrated obstacles can be removed.",
		"imageUrl": "remove_obstacle.png",
		"magic": "water"
	},
	{
		"id": "24",
		"name": "Scuttle Boat",
		"level": 2,
		"manaCost": 8,
		"basic": "Spell has 50% chance of destroying a boat, unless occupied.",
		"advanced": "Spell has a 75% chance of destroying a boat, unless occupied.",
		"expert": "Spell destroys a boat, unless occupied.",
		"imageUrl": "scuttle_boat.png",
		"magic": "water"
	},
	{
		"id": "25",
		"name": "Weakness",
		"level": 2,
		"manaCost": 8,
		"basic": "One enemy target unit's attack rating is reduced by three.",
		"advanced": "Same as Basic effect, except attack rating is reduced by six.",
		"expert": "All enemy units' attack ratings are reduced by six.",
		"imageUrl": "weakness.png",
		"magic": "water"
	},
	{
		"id": "26",
		"name": "Forgetfulness",
		"level": 3,
		"manaCost": 12,
		"basic": "Half of the creatures in target, enemy troop, with ranged attack forget to shoot.",
		"advanced": "Target, enemy troop with ranged attack cannot use its ranged attack.",
		"expert": "All enemy troops with ranged attacks cannot use their ranged attacks.",
		"imageUrl": "forgetfulness.png",
		"magic": "water"
	},
	{
		"id": "27",
		"name": "Frost Ring",
		"level": 3,
		"manaCost": 12,
		"basic": "Troops in hexes surrounding target hex receive ((Power x 10) + 15) in damage. Target hex is unaffected.",
		"advanced": "Same as Basic effect, except damage is ((Power x 10) + 30).",
		"expert": "Same as Basic effect, except damage is ((Power x 10) + 60).",
		"imageUrl": "frost_ring.png",
		"magic": "water"
	},
	{
		"id": "28",
		"name": "Mirth",
		"level": 3,
		"manaCost": 15,
		"basic": "One friendly target unit's morale is increased by one.",
		"advanced": "One friendly target unit's morale is increased by two.",
		"expert": "All friendly units' morale is increased by two.",
		"imageUrl": "mirth.png",
		"magic": "water"
	},
	{
		"id": "29",
		"name": "Teleport",
		"level": 3,
		"manaCost": 15,
		"basic": "Target, friendly troop instantly moves to an unoccupied target hex. Troop cannot teleport over walls or moats.",
		"advanced": "Same as Basic effect, except troop can teleport over walls.",
		"expert": "Troop can move to any unoccupied hex.",
		"imageUrl": "teleport.png",
		"magic": "water"
	},
	{
		"id": "30",
		"name": "Clone",
		"level": 4,
		"manaCost": 24,
		"basic": "Creates a duplicate of target, friendly troop level 1-5. The duplicate can attack but is dispelled if it receives any damage.",
		"advanced": "Same as Basic effect, except the duplicate may be of a level 1-6 troop.",
		"expert": "Same as Basic effect, except the duplicate may be of a level 1-7 troop.",
		"imageUrl": "clone.png",
		"magic": "water"
	},
	{
		"id": "31",
		"name": "Prayer",
		"level": 4,
		"manaCost": 16,
		"basic": "One friendly unit's attack, defense, and speed (hexes per turn) ratings are increased by two.",
		"advanced": "One friendly unit's attack, defense, and speed ratings are increased by four.",
		"expert": "All friendly units' attack, defense, and speed ratings are increased by four.",
		"imageUrl": "prayer.png",
		"magic": "water"
	},
	{
		"id": "32",
		"name": "Water Walk",
		"level": 4,
		"manaCost": 12,
		"basic": "The casting hero may follow a movement path across water, provided the end destination is an unoccupied location on land. Water movement may be up to 60% of the hero's normal movement.",
		"advanced": "Same as Basic effect, except that water movement may be up to 80% of the hero's normal movement.",
		"expert": "Same as Basic effect, except that water movement may be made at the hero's full, normal movement.",
		"imageUrl": "water_walk.png",
		"magic": "water"
	},
	{
		"id": "33",
		"name": "Summon Water Elemental",
		"level": 5,
		"manaCost": 25,
		"basic": "A troop containing (Power x 2) water elementals appears on the side of the casting player. Only one type of elemental can be summoned.",
		"advanced": "Same as Basic effect, except that (Power x 3) water elementals are summoned.",
		"expert": "Same as Basic effect, except that (Power x 4) water elementals are summoned.",
		"imageUrl": "summon_water_elemental.png",
		"magic": "water"
	}
]